---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationTopOfPart
source: html/0dfeddd8-9a79-5f03-43ed-b54ba42cef66.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationTopOfPart Property

"Upper End Top of Insulation Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationTopOfPart { get; }
```